samoloty/app/controllers/fortunes_controller.rb

  def index
    @fortunes = Fortune.all
---
SELECT "fortunes".* FROM "fortunes"

  def show
    @fortune = Fortune.find(params[:id])
---
SELECT "fortunes".* FROM "fortunes" WHERE "fortunes"."id" = ? LIMIT 1  [["id", "1"]]

  def edit
    @fortune = Fortune.find(params[:id])
---
SELECT "fortunes".* FROM "fortunes" WHERE "fortunes"."id" = ? LIMIT 1  [["id", "1"]]

  def create
    #@fortune = Fortune.new(params[:fortune])
	  @fortune = Fortune.create( params[:fortune] )
---
INSERT INTO "fortunes" ("created_at", "quotation", "source", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", Thu, 08 Nov 2012 19:01:26 UTC +00:00], ["quotation", "asdasdasd"], ["source", "xxxxxxxxxxxx"], ["updated_at", Thu, 08 Nov 2012 19:01:26 UTC +00:00]]

  def update
    @fortune = Fortune.find(params[:id])

    respond_to do |format|
      if @fortune.update_attributes(params[:fortune])
---
SELECT "fortunes".* FROM "fortunes" WHERE "fortunes"."id" = ? LIMIT 1  [["id", "1"]]
UPDATE "fortunes" SET "avatar_file_name" = 'passat-samochod-slubny.jpg', "avatar_content_type" = 'image/jpeg', "avatar_file_size" = 74935, "avatar_updated_at" = '2012-12-04 20:45:49.966517', "updated_at" = '2012-12-04 20:45:50.407413' WHERE "fortunes"."id" = 1

   def destroy
    @fortune = Fortune.find(params[:id])
    @fortune.destroy
---
SELECT "fortunes".* FROM "fortunes" WHERE "fortunes"."id" = ? LIMIT 1  [["id", "1"]]
DELETE FROM "fortunes" WHERE "fortunes"."id" = ?  [["id", 1]]