samoloty/app/controllers/sessions_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 1]]
INSERT INTO "authorizations" ("created_at", "provider", "uid", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)  [["created_at", Tue, 04 Dec 2012 12:07:50 UTC +00:00], ["provider", "facebook"], ["uid", "100001713792035"], ["updated_at", Tue, 04 Dec 2012 12:07:50 UTC +00:00], ["user_id", 1]]
---
  def create
    auth_hash = request.env['omniauth.auth']
    if session[:user_id]
      # Means our user is signed in. Add the authorization to the user
      User.find(session[:user_id]).add_provider(auth_hash)
      redirect_to root_url

    else
      # Log him in or sign him up
      auth = Authorization.find_or_create(auth_hash)